---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeVertexArray.Append(Autodesk.Revit.DB.SlabShapeVertex)
source: html/27346af4-b4da-61b4-1d46-8eac9e9fa9c6.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArray.Append Method

Add the item to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	SlabShapeVertex item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.SlabShapeVertex`) - The item to be added.